In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\afham\appdata\local\programs\python\python313\lib\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\afham\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\afham\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\afham\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\afham\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\afham\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [35]:
data =[["afham",40,80,50,60,70],
       ["ali",40,80,50,None,70],
       ["ahmed",40,80,50,60,70]]
df = pd.DataFrame(data,columns=["Name","science","math","english","urdu","chemistry"],index=["std1","std2","std3"])

In [36]:
df

       Name  science  math  english  urdu  chemistry
std1  afham       40    80       50  60.0         70
std2    ali       40    80       50   NaN         70
std3  ahmed       40    80       50  60.0         70

In [32]:
df.loc["std2"]

Name         ali
science       40
math          80
english       50
urdu
chemistry     70
Name: std2, dtype: object

In [33]:
df.iloc[0]

Name         afham
science         40
math            80
english         50
urdu            60
chemistry       70
Name: std1, dtype: object

In [28]:
df.drop('math',axis=1, inplace=True)

In [37]:
df.dtypes

Name          object
science        int64
math           int64
english        int64
urdu         float64
chemistry      int64
dtype: object

In [39]:
df.dropna(axis=1)

       Name  science  math  english  chemistry
std1  afham       40    80       50         70
std2    ali       40    80       50         70
std3  ahmed       40    80       50         70

In [40]:
df.describe()

       science  math  english  urdu  chemistry
count      3.0   3.0      3.0   2.0        3.0
mean      40.0  80.0     50.0  60.0       70.0
std        0.0   0.0      0.0   0.0        0.0
min       40.0  80.0     50.0  60.0       70.0
25%       40.0  80.0     50.0  60.0       70.0
50%       40.0  80.0     50.0  60.0       70.0
75%       40.0  80.0     50.0  60.0       70.0
max       40.0  80.0     50.0  60.0       70.0

In [41]:
df.describe().urdu

count     2.0
mean     60.0
std       0.0
min      60.0
25%      60.0
50%      60.0
75%      60.0
max      60.0
Name: urdu, dtype: float64

In [21]:
df['science']+df['math']

std1    120
std2    120
std3    120
dtype: int64

In [22]:
df.science + df.urdu

std1    100
std2    100
std3    100
dtype: int64

In [25]:
gg=pd.Series([2,6,8,9,6,5,3],index=["1","2","3",'4','5','6','7'])

In [26]:
gg.pop("4")

np.int64(9)

In [43]:
dataset = pd.read_csv("invest.csv")

In [45]:
dataset

   Year Profit Percentage  Additional Investment  Total Amount
0     1               25%                      0       6250.00
1     2              -30%                      0       4375.00
2     3               22%                      0       5337.50
3     4               28%                      0       6832.00
4     5               25%                   2000      10840.00
5     6                5%                      0      11382.00
6     7              -25%                      0       8536.50
7     8               30%                      0      11097.45
8     9              -22%                      0       8656.01
9    10               28%                      0      11079.69

In [46]:
dataset.head()

   Year Profit Percentage  Additional Investment  Total Amount
0     1               25%                      0        6250.0
1     2              -30%                      0        4375.0
2     3               22%                      0        5337.5
3     4               28%                      0        6832.0
4     5               25%                   2000       10840.0

In [44]:
dataset.dtypes

Year                       int64
Profit Percentage         object
Additional Investment      int64
Total Amount             float64
dtype: object